artillery-tests/tests/substrate.yml
config:
  target: "ws://127.0.0.1:9944"
  processor: "../common.js"
  phases:
    - duration: 60
      arrivalRate: 10
      maxVusers: 100
      name: "Getting connections"
  engines:
    substrate: { }
scenarios:
  - engine: substrate
    name: Infinite substrate transfer funds
    flow:
      - function: "createTestAccount"
      - loop:
        - function: "transferFunds"
  - engine: substrate
    name: "Infinite ink contract deployment"
    flow:
      - function: "createTestAccount"
      - loop:
        - function: "deployInkErc20"
  - engine: substrate
    name: "Infinite erc20 calls"
    flow:
      - function: "createTestAccount"
      - function: "deployInkErc20"
      - loop:
        - function: "transferErc20Funds"