artillery-tests/tests/substrate.yml
config:
  target: "ws://127.0.0.1:9944"
  processor: "../common.js"
  phases: # defines phases that it will run in loop (if one will repeat)
    - duration: 60  # time
      arrivalRate: 10 # how much new users coming every second
      maxVusers: 100 # max amount
      name: "Getting connections"
  engines:
    substrate: { }
scenarios: # the user will hang in one of the loops
  - engine: substrate
    name: Infinite substrate transfer funds
    flow:
      - function: "createTestAccount"
      - loop:
        - function: "transferFunds"
  - engine: substrate
    name: "Infinite ink contract deployment"
    flow:
      - function: "createTestAccount"
      - loop:
        - function: "deployInkErc20"
  - engine: substrate
    name: "Infinite erc20 calls"
    flow:
      - function: "createTestAccount"
      - function: "deployInkErc20"
      - loop:
        - function: "transferErc20Funds"